# Pandas

In [5]:
import pandas as pd

## Pandas Series

In [7]:
# format -1 
Data=pd.Series([1,2,3,4],index=[0,1,2,3])
Data

0    1
1    2
2    3
3    4
dtype: int64

In [8]:
# Format -2
ser=pd.Series({"a":1,"b":2,"c":3})
ser

a    1
b    2
c    3
dtype: int64

In [9]:
# Format- 3
d = {'a': 1, 'b': 2, 'c': 3}
ser = pd.Series(data=d, index=['a', 'b', 'c'])
ser

a    1
b    2
c    3
dtype: int64

In [10]:
Data[0:2]

0    1
1    2
dtype: int64

In [11]:
area_dict = {'California': 423967, 'Texas': 695662, 'New York': 141297,
 'Florida': 170312, 'Illinois': 149995}
area = pd.Series(area_dict)
area

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
dtype: int64

In [12]:
population_dict = {'California': 38332521,
 'Texas': 26448193,
'New York': 19651127,
'Florida': 19552860,
'Illinois': 12882135}
population = pd.Series(population_dict)
population

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

# Pandas Dataframe

## Pandas Dataframe()

In [15]:
data ={
    "Student":["boomi","praba","Bharathi","Mazi"],
    "Rank":[1,2,3,4],
    "Marks":[95,70,80,96]
      }
df=pd.DataFrame(data)
print("Student Records\n\n",df)
df

Student Records

     Student  Rank  Marks
0     boomi     1     95
1     praba     2     70
2  Bharathi     3     80
3      Mazi     4     96

    Student  Rank  Marks
0     boomi     1     95
1     praba     2     70
2  Bharathi     3     80
3      Mazi     4     96

In [16]:
df.size, df.shape, df.ndim

(12, (4, 3), 2)

In [17]:
states=pd.DataFrame({"Population":population,"Area":area})
states

            Population    Area
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995

In [18]:
states.index

Index(['California', 'Texas', 'New York', 'Florida', 'Illinois'], dtype='object')

In [19]:
states.columns

Index(['Population', 'Area'], dtype='object')

In [20]:
## From single Series objest
pd.DataFrame(population,columns=["Population"])

            Population
California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135

## DataFrame.loc()

### Syntax:- Dataframe.loc[rows,columns]

In [23]:
data ={
    "Student":["boomi","praba","Bharathi","Mazi"],
    "Rank":[1,2,3,4],
    "Marks":[95,70,80,96]
      }
df=pd.DataFrame(data,index=["Row1","Row2","Row3","Row4"])
df

       Student  Rank  Marks
Row1     boomi     1     95
Row2     praba     2     70
Row3  Bharathi     3     80
Row4      Mazi     4     96

In [24]:
# Only Row
df.loc[["Row3"]]

       Student  Rank  Marks
Row3  Bharathi     3     80

In [25]:
# Rows and Columns
df.loc[["Row1"],["Marks"]]

      Marks
Row1     95

In [26]:
# using slicing for rows with columns
df.loc["Row1":"Row3",["Marks"]]

      Marks
Row1     95
Row2     70
Row3     80

In [27]:
# using slicing for both rows,columns
df.loc["Row1":"Row3","Student":"Marks"]

       Student  Rank  Marks
Row1     boomi     1     95
Row2     praba     2     70
Row3  Bharathi     3     80

In [28]:
df.loc["Row1":"Row2"]

     Student  Rank  Marks
Row1   boomi     1     95
Row2   praba     2     70

## Dataframe.iloc()

In [30]:
df.iloc[[1,2]]

       Student  Rank  Marks
Row2     praba     2     70
Row3  Bharathi     3     80

In [31]:
# Using Slicing
df.iloc[:3]

       Student  Rank  Marks
Row1     boomi     1     95
Row2     praba     2     70
Row3  Bharathi     3     80

In [32]:
# Using True or False
df.iloc[[True,False,False,True]]

     Student  Rank  Marks
Row1   boomi     1     95
Row4    Mazi     4     96

In [33]:
# using With lists of integers.
df.iloc[[0,1],[1,2]]

      Rank  Marks
Row1     1     95
Row2     2     70

In [34]:
df.iloc[:,[1,2]]

      Rank  Marks
Row1     1     95
Row2     2     70
Row3     3     80
Row4     4     96

In [35]:
df.iloc[0:3,[0]]

       Student
Row1     boomi
Row2     praba
Row3  Bharathi

## index

In [37]:
data ={
    "Student":["boomi","praba","Bharathi","Mazi"],
    "Rank":[1,2,3,4],
    "Marks":[95,70,80,96]
      }

df=pd.DataFrame(data,index=[1,2,3,4])
df

    Student  Rank  Marks
1     boomi     1     95
2     praba     2     70
3  Bharathi     3     80
4      Mazi     4     96

### iterate a pandas Dataframe using for loop

In [39]:
data ={
    "Student":["boomi","praba","Bharathi","Mazi"],
    "Rank":[1,2,3,4],
    "Marks":[95,70,80,96]
      }

df=pd.DataFrame(data,index=[1,2,3,4])
df
print("\nDisplaying the columns")
for col in df:
    print(col)

Displaying the columns
Student
Rank
Marks

## Attribute And mehod

### dtypes

In [42]:
data ={
    "Student":["boomi","praba","Bharathi","Mazi"],
    "Rank":[1,2,3,4],
    "Marks":[95,70,80,96]
      }
df=pd.DataFrame(data,index=["Row1","Row2","Row3","Row4"])

In [43]:
df.dtypes

Student    object
Rank        int64
Marks       int64
dtype: object

### ndim

In [45]:
df.ndim

2

### Size

In [47]:
df.size

12

### Shape

In [49]:
df.shape

(4, 3)

### Index

In [51]:
df.index

Index(['Row1', 'Row2', 'Row3', 'Row4'], dtype='object')

### Transpose

In [53]:
df.T

          Row1   Row2      Row3  Row4
Student  boomi  praba  Bharathi  Mazi
Rank         1      2         3     4
Marks       95     70        80    96

### Head

In [55]:
df.head()

       Student  Rank  Marks
Row1     boomi     1     95
Row2     praba     2     70
Row3  Bharathi     3     80
Row4      Mazi     4     96

In [56]:
df.head(2)

     Student  Rank  Marks
Row1   boomi     1     95
Row2   praba     2     70

### Tail

In [58]:
df.tail()

       Student  Rank  Marks
Row1     boomi     1     95
Row2     praba     2     70
Row3  Bharathi     3     80
Row4      Mazi     4     96

In [59]:
df.tail(3)

       Student  Rank  Marks
Row2     praba     2     70
Row3  Bharathi     3     80
Row4      Mazi     4     96

## Join

## Concatenate

In [146]:
iphone_users=pd.DataFrame({
    "names":['A','B','C'],
    'Models':[12,13,14]
})

iphone_users

  names  Models
0     A      12
1     B      13
2     C      14

In [172]:
Oneplus=pd.DataFrame({
    "names":['A','B','C'],
    'Models':[9,10,11]
})
Oneplus

  names  Models
0     A       9
1     B      10
2     C      11

### Syntax for Concat

In [149]:
df=pd.concat([iphone_users,Oneplus])
df

  names  Models
0     A      12
1     B      13
2     C      14
0     D       9
1     E      10
2     F      11

### How to ignore intex

In [152]:
df=pd.concat([iphone_users,Oneplus],ignore_index=True)
df

  names  Models
0     A      12
1     B      13
2     C      14
3     D       9
4     E      10
5     F      11

In [164]:
df=pd.concat([iphone_users,Oneplus],keys=['iphone','one'])
df

         names  Models
iphone 0     A      12
       1     B      13
       2     C      14
one    0     D       9
       1     E      10
       2     F      11

In [168]:
df.loc['iphone']

  names  Models
0     A      12
1     B      13
2     C      14

In [170]:
df.loc['one']

  names  Models
0     D       9
1     E      10
2     F      11

### Changing the axis

In [177]:
df=pd.concat([iphone_users,Oneplus],axis=1)
df

  names  Models names  Models
0     A      12     A       9
1     B      13     B      10
2     C      14     C      11

### Droping the Duplicate columns

In [184]:
df.T.drop_duplicates().T

  names Models Models
0     A     12      9
1     B     13     10
2     C     14     11